# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [176]:
import pandas as pd
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv"

df = pd.read_csv(url)
print(df.info())
def col_name():
    name_new=[]
    for name in df.columns:
        name_new.append(name.lower().replace(" ","_"))
    return name_new
    
df.columns = col_name()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 26 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Unnamed: 0                     10910 non-null  int64
 1   Customer                       10910 non-null  object
 2   State                          10279 non-null  object
 3   Customer Lifetime Value        10910 non-null  float64
 4   Response                       10279 non-null  object
 5   Coverage                       10910 non-null  object
 6   Education                      10910 non-null  object
 7   Effective To Date              10910 non-null  object
 8   EmploymentStatus               10910 non-null  object
 9   Gender                         10910 non-null  object
 10  Income                         10910 non-null  int64
 11  Location Code                  10910 non-null  object
 12  Marital Status                 10910 non-null  object
 13  Monthly Premium Auto           10910 non-null  int64
 14  Months Since Last Claim        10277 non-null  float64
 15  Months Since Policy Inception  10910 non-null  int64
 16  Number of Open Complaints      10277 non-null  float64
 17  Number of Policies             10910 non-null  int64
 18  Policy Type                    10910 non-null  object
 19  Policy                         10910 non-null  object
 20  Renew Offer Type               10910 non-null  object
 21  Sales Channel                  10910 non-null  object
 22  Total Claim Amount             10910 non-null  float64
 23  Vehicle Class                  10288 non-null  object
 24  Vehicle Size                   10288 non-null  object
 25  Vehicle Type                   5428 non-null   object
dtypes: float64(4), int64(5), object(17)
memory usage: 2.2+ MB
None

In [177]:
df_yes = df[["total_claim_amount", "response"]]
df_yes = df_yes[(df_yes["total_claim_amount"]>=1.000) & (df_yes["response"]=="Yes")]
df_yes

       total_claim_amount response
3              484.013411      Yes
8              739.200000      Yes
15             547.200000      Yes
19              19.575683      Yes
27              60.036683      Yes
...                   ...      ...
10844          547.200000      Yes
10852          791.878042      Yes
10872          547.200000      Yes
10887          528.200860      Yes
10897          158.077504      Yes

[1466 rows x 2 columns]

2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.

In [178]:
df_gender = df[(df["response"]=="Yes")]

df_gender = df_gender[["total_claim_amount", "gender", "policy_type"]]

df_gender.groupby(["gender", "policy_type"]).agg({"total_claim_amount": "mean"})

                       total_claim_amount
gender policy_type
F      Corporate Auto          433.738499
       Personal Auto           452.965929
       Special Auto            453.280164
M      Corporate Auto          408.582459
       Personal Auto           457.010178
       Special Auto            429.527942

In [179]:
df_gender.groupby(["policy_type"]).agg({"total_claim_amount": "mean"})

                total_claim_amount
policy_type
Corporate Auto          421.744598
Personal Auto           454.980536
Special Auto            441.935819

### If we analyse the types of policies it's clear that the corporate auto and the special auto have higher total claims in the female gender. on the personal auto the value it's similar (a little higher in the male).

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [180]:
df_st = df[["customer", "state"]]
df_st = df_st.groupby("state")

df_st.size()

state
Arizona       1937
California    3552
Nevada         993
Oregon        2909
Washington     888
dtype: int64

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [181]:

df.groupby(["education", "gender"]).agg({"customer_lifetime_value": "mean"})

                             customer_lifetime_value
education            gender
Bachelor             F                   7874.269478
                     M                   7703.601675
College              F                   7748.823325
                     M                   8052.459288
Doctor               F                   7328.508916
                     M                   7415.333638
High School or Below F                   8675.220201
                     M                   8149.687783
Master               F                   8157.053154
                     M                   8168.832659

### It's possible to notice that in the lower education (High School or Below) the values are higher in both genders, but in the male gender its possible to verify that the master degree has the highest value in the male gender. In the female it's the High School or Below level that has the highest mean.
### In the college, doctor and master it's possible to see that the female gender has the lowest values.

In [182]:
df.groupby(["education", "gender"]).agg({"customer_lifetime_value": "max"})

                             customer_lifetime_value
education            gender
Bachelor             F                   73225.95652
                     M                   67907.27050
College              F                   61850.18803
                     M                   61134.68307
Doctor               F                   44856.11397
                     M                   32677.34284
High School or Below F                   55277.44589
                     M                   83325.38119
Master               F                   51016.06704
                     M                   50568.25912

### If we analyse the max values it's visible that the female gender has the higher values except in the High School or Below level which it the highest value in all apolicies.

In [183]:
df.groupby(["education", "gender"]).agg({"customer_lifetime_value": "mean"})

                             customer_lifetime_value
education            gender
Bachelor             F                   7874.269478
                     M                   7703.601675
College              F                   7748.823325
                     M                   8052.459288
Doctor               F                   7328.508916
                     M                   7415.333638
High School or Below F                   8675.220201
                     M                   8149.687783
Master               F                   8157.053154
                     M                   8168.832659

### The minimum value it's always higher in the male gender except in the High School or Below and Bachelor levels. In the Master the diference it minimun between the genders.

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [184]:
# your code goes here